Tekla.Structures.Internal.dotCoordinateSystem_t
The serialization structure for CoordinateSystem.

Tekla.Structures.Internal.dotCoordinateSystem_t.Origin
The origin of the coordinate system.

Tekla.Structures.Internal.dotCoordinateSystem_t.AxisX
The X-Axis of the coordinate system.

Tekla.Structures.Internal.dotCoordinateSystem_t.AxisY
The Y-Axis of the coordinate system.

Tekla.Structures.Internal.dotCoordinateSystem_t.ToStruct(Tekla.Structures.Geometry3d.CoordinateSystem)
CoordinateSystem to dotCoordinateSystem_t.
P:

Tekla.Structures.Internal.dotCoordinateSystem_t.FromStruct(Tekla.Structures.Geometry3d.CoordinateSystem)
P: